src/test/jmeter/Summary Report.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.2" jmeter="3.3 r1808647">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </Arguments>
      <hashTree/>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">127.0.0.1</stringProp>
        <stringProp name="HTTPSampler.port">8161</stringProp>
        <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10000</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <longProp name="ThreadGroup.start_time">1513889822000</longProp>
        <longProp name="ThreadGroup.end_time">1513889822000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">Hello world: ${__counter(FALSE)} - 1L6MOYUCVTZJS37B91FYA8KL0DDIPB7GZFPETBCNV4JDOP46O008U62SYJQSTLOMFRLX6N2A3V2B34J95M0NERZ4BPYA3NPN87CHBM81PTRL5FW1NB0NT3CJ2SVIWED7O64AAH70AZJWQ6VV182F5NH5AE4DVKXTZT7NCFTB1ASI3DS4PYO0GXX2MLJJ72X7SE7UOOCKCVDHP8WACXRMNRHYQ8X066MC6VLI8VNKXXYVQI3YAF5W20GJ5OCN042UKZE3ESFQ8R6NPU1B3DE07LWKC1IAA075TPQSKLI08PE1L01G9V502ZBZU6S0WQ9CJC28GNGWMR73JKM51BJVPPCDP8TP5GJ1X6TJJARF1Y0M5XYO4QQXPIVHLEFIFA0RU4NK1FNYACPJI22LZLLFCC4VY4FMWT6718CZFY1NY8DNIYW5WM2B0X8BU1XAUHAG6X1UGAX17MAXVMIIQUJJEUZAXS0L8WWBQBQCYEZSJLQGGLW254BI1RLNBCECRJFOO3WW88JZLA908NOEOW33GI9SZP3DXDB7SHMPWSWMTLPMIG2RBN8PY9H1VYA9Y6WSOIUVHW5E52N7X2PUJXTWUB71R0U0W18DQY4CWNQO1Z9XHMF10V5PUQI1HV1KOB54S90S242VC60QW32E2T6PTHKVCJS2PMITPWC2RI1CLXZ54N6W7CHWALXD9ZU5BTU1MUJUHWTHFE274W243A2J9TWQ0X2C3YOCDGBBCAFHN5XLYKFM5CEVD53PJP0XZYELOUI04UZZTGJIUYAN3LRIEVJFBZPNNYPU8495A1O6JY6WXQER1YF9L7IEER7AAY8GGKXS1QY5DHQIWE0GIRI5D02HJN77BM5ID4PMEXLKRDGPIQDQPDIFTVBTO6D2IOLD8T5GJ48K0IOFUPDHPOBYKU4AQQZTX11VRO9G3CFUOFPW6NL6T7QEROXGNUNJQV8RN7G0ITXX2QP0ASQLVKLBMWEGM4AT4S21K22DYQYK3X66H5</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/rest/queues/TEST/create</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
    <WorkBench guiclass="WorkBenchGui" testclass="WorkBench" testname="WorkBench" enabled="true">
      <boolProp name="WorkBench.save">true</boolProp>
    </WorkBench>
    <hashTree/>
  </hashTree>
</jmeterTestPlan>